Revit 2027 API
ImageInstance.GetLocation Method
 Returns the location of one of the points of the ImageInstance
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetLocation(
	BoxPlacement placementPoint
)
Public Function GetLocation (
	placementPoint As BoxPlacement
) As XYZ
public:
XYZ^ GetLocation(
	BoxPlacement placementPoint
)
member GetLocation :
        placementPoint : BoxPlacement -> XYZ
Parameters
placementPoint BoxPlacement
 The placementPoint specifies for which point of the ImageInstance the location should be returned.
Return Value
XYZ
 The location of the specified point
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace